<a href="https://colab.research.google.com/github/manojgupta3051994/dsmp-pre-work/blob/master/Pandas_tricks.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import pandas as pd
pd.__version__

'0.25.3'

In [3]:
df = pd.DataFrame([[12,25,2017,10],[1,15,2018,11]],columns = ['month','day','year','hour'])
df

   month  day  year  hour
0     12   25  2017    10
1      1   15  2018    11

In [4]:
pd.to_datetime(df)

0   2017-12-25 10:00:00
1   2018-01-15 11:00:00
dtype: datetime64[ns]

In [6]:
pd.to_datetime(df[['month','day','year','hour']])

0   2017-12-25 10:00:00
1   2018-01-15 11:00:00
dtype: datetime64[ns]

In [7]:
df.index = pd.to_datetime(df[['month','day','year','hour']])
df

                     month  day  year  hour
2017-12-25 10:00:00     12   25  2017    10
2018-01-15 11:00:00      1   15  2018    11

In [8]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [9]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [11]:
drinks['continent'] = drinks['continent'].astype('category')
drinks.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [12]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry' , dtype = {'continent':'category'})
drinks.dtypes

country                           object
beer_servings                      int64
spirit_servings                    int64
wine_servings                      int64
total_litres_of_pure_alcohol     float64
continent                       category
dtype: object

In [13]:
drinks = pd.read_csv('http://bit.ly/drinksbycountry')
drinks.head()

       country  beer_servings  ...  total_litres_of_pure_alcohol  continent
0  Afghanistan              0  ...                           0.0       Asia
1      Albania             89  ...                           4.9     Europe
2      Algeria             25  ...                           0.7     Africa
3      Andorra            245  ...                          12.4     Europe
4       Angola            217  ...                           5.9     Africa

[5 rows x 6 columns]

In [14]:
drinks.dtypes

country                          object
beer_servings                     int64
spirit_servings                   int64
wine_servings                     int64
total_litres_of_pure_alcohol    float64
continent                        object
dtype: object

In [0]:
drinks = drinks.astype({'beer_servings' : 'float' , 'wine_Servings': 'float'})
drinks.dtypes

In [0]:
drinks.groupby('continent').beer_servings.agg(['mean','max','min'])

In [19]:
drinks.beer_servings.agg(['mean','max','min'])

mean    106.160622
max     376.000000
min       0.000000
Name: beer_servings, dtype: float64

In [20]:
drinks.agg(['mean','max','min'])

          country  beer_servings  ...  total_litres_of_pure_alcohol      continent
max      Zimbabwe     376.000000  ...                     14.400000  South America
min   Afghanistan       0.000000  ...                      0.000000         Africa
mean          NaN     106.160622  ...                      4.717098            NaN

[3 rows x 6 columns]

In [22]:
drinks.describe()

       beer_servings  ...  total_litres_of_pure_alcohol
count     193.000000  ...                    193.000000
mean      106.160622  ...                      4.717098
std       101.143103  ...                      3.773298
min         0.000000  ...                      0.000000
25%        20.000000  ...                      1.300000
50%        76.000000  ...                      4.200000
75%       188.000000  ...                      7.200000
max       376.000000  ...                     14.400000

[8 rows x 4 columns]